CSI API ETABS v1
cDatabaseTables.GetAllTables Method
 Returns all of the tables along with their import type and indicates if any data is available in the model to fill the table.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetAllTables(
	ref int NumberTables,
	ref string[] TableKey,
	ref string[] TableName,
	ref int[] ImportType,
	ref bool[] IsEmpty
)
Function GetAllTables (
	ByRef NumberTables As Integer,
	ByRef TableKey As String(),
	ByRef TableName As String(),
	ByRef ImportType As Integer(),
	ByRef IsEmpty As Boolean()
) As Integer
Dim instance As cDatabaseTables
Dim NumberTables As Integer
Dim TableKey As String()
Dim TableName As String()
Dim ImportType As Integer()
Dim IsEmpty As Boolean()
Dim returnValue As Integer
returnValue = instance.GetAllTables(NumberTables,
	TableKey, TableName, ImportType,
	IsEmpty)
int GetAllTables(
	int% NumberTables,
	array<String^>^% TableKey,
	array<String^>^% TableName,
	array<int>^% ImportType,
	array<bool>^% IsEmpty
)
abstract GetAllTables :
        NumberTables : int byref *
        TableKey : string[] byref *
        TableName : string[] byref *
        ImportType : int[] byref *
        IsEmpty : bool[] byref -> int
Parameters
NumberTables
Type: System.Int32
Returned Item: The number of tables that are currently available for display.
TableKey
Type: System.String[]
Returned Item: A zero-based array of the table keys for the available tables.
TableName
Type: System.String[]
Returned Item: A zero-based array of the table names for the available tables.
ImportType
Type: System.Int32[]
Returned Item: This is either 0, 1, 2 or 3 indicating the import type for the table.
not importable
importable but not interactively importable
importable and interactively importable when the model is unlocked
importable and interactively importable when the model is unlocked and locked
IsEmpty
Type: System.Boolean[]
Returned Item: False means data is available in the model to fill the table. True means there is no data in the model to fill the table.
Return Value
Type: Int32
Remarks
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace